export default function PrivacyPolicy() {
  return (
    <section className="bg-secondary">
      <article className="w-8/12 mx-auto p-6">
        <h1 className="text-center text-primary text-2xl font-bold mb-4">
          سياسة الخصوصية
        </h1>

        <section className="flex flex-col gap-6">
          <section>
            <h2 className="text-primary font-semibold">المقدمة:</h2>
            <p>
              توضح سياسة الخصوصية هذه كيفية جمعنا واستخدامنا وكشفنا وحماية
              المعلومات الشخصية لعملائنا فيما يتعلق بخدمات صيانة المركبات الخاصة
              بنا.
            </p>
          </section>

          <section>
            <h2 className="text-primary font-semibold">أنواع المعلومات الشخصية المجمعة:</h2>
            <ul>
              <li>-
                معلومات الاتصال، مثل الاسم والعنوان ورقم الهاتف وعنوان البريد
                الإلكتروني
              </li>
              <li>-
                معلومات المركبة، مثل الصنع والطراز والسنة ورقم الهيكل (VIN) ورقم
                لوحة الترخيص
              </li>
              <li>-
                تاريخ الخدمة والتفضيلات، مثل نوع الخدمات المقدمة وتكرار مواعيد
                الخدمة
              </li>
            </ul>
          </section>

          <section>
            <h2 className="text-primary font-semibold">الغرض من جمع المعلومات:</h2>
            <p>
              تُستخدم المعلومات الشخصية التي نجمعها لتقديم وتحسين خدمات صيانة
              المركبات الخاصة بنا. قد نستخدم هذه المعلومات للأغراض التالية:
            </p>
            <ul>
              <li>- جدولة وتأكيد مواعيد الخدمة</li>
              <li>- تقديم عروض الخدمة والفواتير</li>
              <li>- التواصل مع عملائنا بشأن مركباتهم وتاريخ الخدمة</li>
              <li> - 
                تخصيص خدماتنا وتصميم اتصالات التسويق بما يلبي احتياجات عملائنا
              </li>
            </ul>
          </section>

          <section>
            <h2 className="text-primary font-semibold">كشف المعلومات الشخصية:</h2>
            <p>
              قد نشارك المعلومات الشخصية مع مقدمي الخدمات الخارجية الذين
              يساعدوننا في تقديم خدمات صيانة المركبات. يُطلب من هؤلاء مقدمي
              الخدمات الحفاظ على سرية وأمان المعلومات الشخصية ويُمنعون من
              استخدامها لأي غرض آخر. قد نكشف أيضًا المعلومات الشخصية حسب
              القانون، مثل الاستجابة لأمر قضائي أو استدعاء.
            </p>
          </section>

          <section>
            <h2 className="text-primary font-semibold">أمان البيانات:</h2>
            <p>
              نتخذ خطوات معقولة لحماية المعلومات الشخصية التي نجمعها من الوصول
              غير المصرح به أو الاستخدام أو الكشف. يتضمن ذلك التدابير الفنية
              والإدارية والبدنية لتأمين أنظمتنا وبياناتنا. ومع ذلك، لا يمكن ضمان
              أن أي نقل للبيانات عبر الإنترنت أو نظام تخزين يمكن أن يكون آمنًا
              بنسبة 100٪. ونتيجة لذلك، لا يمكننا ضمان أمان أي معلومات شخصية
              تُرسل إلينا أو تُخزن على أنظمتنا.
            </p>
          </section>

          <section>
            <h2 className="text-primary font-semibold">الوصول والتصحيح:</h2>
            <p>
              يمكن للعملاء طلب الوصول إلى معلوماتهم الشخصية وطلب تصحيح أي عدم
              دقة. سنرد على مثل هذه الطلبات في الوقت المناسب ونتخذ خطوات معقولة
              للتحقق من هوية الطالب.
            </p>
          </section>

          <section>
            <h2 className="text-primary font-semibold">تغييرات في سياسة الخصوصية:</h2>
            <p>
              قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر لتعكس التغييرات في
              ممارسات الخصوصية لدينا. سنُعلم العملاء بأي تغييرات مهمة في سياسة
              الخصوصية هذه عن طريق نشر السياسة المحدثة على موقعنا على الويب.
            </p>
          </section>

          <section>
            <h2 className="text-primary font-semibold">تواصل معنا:</h2>
            <p>
              إذا كان لديك أي أسئلة أو استفسارات حول سياسة الخصوصية لدينا أو
              المعلومات الشخصية التي نجمعها، يرجى الاتصال بنا على العنوان أو رقم
              الهاتف المدرج على موقعنا على الويب.
            </p>
          </section>
        </section>
      </article>
    </section>
  );
}
